package main
import (
	"fmt"
	"time"
	"sync"
)
//计算阶乘并放入map
var (
	myMap = make(map[int]int,10)
	//声明一个全局互斥锁
	//sync 是包：synchornized 同步
	//Mutex 互斥
	lock sync.Mutex
)
func test(n int) {
	res := 1
	for i := 1; i <= n; i++ {
		res *= i
	}
	//多个协程同时写入
	// error: concurrent map writes
	//加锁
	lock.Lock()
	myMap[n] = res
	//解锁
	lock.Unlock()
}
func main() {
	//开启多个协程，将统计结果放入map
	//200数据太大无法存储
	for i := 1; i <= 20; i++ {
		go test(i)
	}
	time.Sleep(time.Second*10)
	//马上遍历可能会没有数据，因为主线程先执行完毕
	fmt.Println(myMap)
	// go build -race 当有资源竞争时输出信息
	// 要在环境变量配置CGO_ENABLED=1
	//因为在实际运行中，主线程可能不知道10秒执行完所有协程
	//因此底层可能仍然出现资源竞争
	lock.Lock()
	for k, v := range myMap {
		fmt.Println(k,"：",v)
	}
	lock.Unlock()
	/* 	map[1:1 2:2 3:6 4:24 5:120 6:720 7:5040 8:40320 9:362880 10:3628800 11:39916800 12:479001600 13:6227020800 14:87178291200 15:1307674368000 16:20922789888000 17:355687428096000 18:6402373705728000 19:121645100408832000 20:2432902008176640000]
		3 ： 6
		2 ： 2
		14 ： 87178291200
		18 ： 6402373705728000
		4 ： 24
		6 ： 720
		7 ： 5040
		12 ： 479001600
		16 ： 20922789888000
		17 ： 355687428096000
		20 ： 2432902008176640000
		9 ： 362880
		13 ： 6227020800
		15 ： 1307674368000
		5 ： 120
		1 ： 1
		8 ： 40320
		19 ： 121645100408832000 */
}